#! usr/bin/python3
# -*- coding: utf-8 -*-

import requests
import re

def getStockDM(stockID):
    # 获取股票是sh还是sz
    i = {5: 'sh', 6: 'sh', 9: 'sz', 0: 'sz', 1: 'sz', 2: 'sz', 3: 'sz'}
    h = int(int(stockID)/100000)
    try:
        dm = i[h]
    except:
        return None
    else:
        return dm


def getStockInfo(stockID):
    """
    返回一个tuple，('大秦铁路', '7.970', '7.980'....)
    1：”大秦铁路”，股票名字；
    2：”27.55″，今日开盘价；
    3：”27.25″，昨日收盘价；
    4：”26.91″，当前价格；
    5：”27.55″，今日最高价；
    6：”26.20″，今日最低价；
    7：”26.91″，竞买价，即“买一”报价；
    8：”26.92″，竞卖价，即“卖一”报价；
    9：”22114263″，成交的股票数，由于股票交易以一百股为基本单位，所以在使用时，通常把该值除以一百；
    10：”589824680″，成交金额，单位为“元”，为了一目了然，通常以“万元”为成交金额的单位，所以通常把该值除以一万；
    11：”4695″，“买一”申请4695股，即47手；
    12：”26.91″，“买一”报价；
    13：”57590″，“买二”
    14：”26.90″，“买二”
    15：”14700″，“买三”
    16：”26.89″，“买三”
    17：”14300″，“买四”
    18：”26.88″，“买四”
    19：”15100″，“买五”
    20：”26.87″，“买五”
    21：”3100″，“卖一”申报3100股，即31手；
    22：”26.92″，“卖一”报价
    (23, 24), (25, 26), (27,28), (29, 230)分别为“卖二”至“卖四的情况”
    31：”2008-01-11″，日期；
    32：”15:05:32″，时间
    """
    dm = getStockDM(stockID)
    if dm == None:
        return None
    stockID = dm + stockID
    regex = r'var hq_str_s[hz]\d{6}=\"([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^,]*),([^"]*)";'
    r = requests.get("http://hq.sinajs.cn/list="+stockID)
    matchObj = re.match(regex, r.text)
    stockData = None
    if matchObj:
        stockData = matchObj.groups()
        return stockData
    return None

